Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: གསོལ་པ། བཅོམ་ལྡན་འདས་སངས་རྒྱས་འབྱུང་བ་སུའི་ལགས།
en: “Blessed One, for whom is there the arising of a buddha?

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སུ་དད་པ་སྐྱེད་པའི་འོ། །
en: “Great King, a buddha arises for those who have given rise to faith.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དད་པ་སྐྱེད་པ་སུ་ལགས།
en: “Blessed One, who gives rise to faith?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སུ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའོ། །
en: “Great King, the one who gives rise to the aspiration for awakening.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་སུ་ལགས།
en: “Blessed One, who gives rise to the aspiration for awakening?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སུ་ལྷག་པའི་བསམ་པ་རྣམ་པར་མི་འཁྲུགས་པའོ། །
en: “Great King, one whose ambition does not waver.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་སུའི་ལྷག་པའི་བསམ་པ་རྣམ་པར་མི་འཁྲུགས་པ་ལགས།
en: “Blessed One, whose ambition does not waver?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སུ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་པའོ། །
en: “Great King, one who gives rise to great compassion.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་པ་ཇི་ལྟ་བུ་ལགས། བཀའ་སྩལ་པ།
en: “Blessed One, how does one give rise to great compassion?”

source: རྒྱལ་པོ་ཆེན་པོ་ཇི་ལྟར་སེམས་ཅན་རྣམས་ལ་ཡོངས་སུ་མི་གཏོང་བ་སྐྱེད་པ་ལྟ་བུའོ། །
en: “Great King, it is the consequence of not forsaking beings.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་སེམས་ཅན་རྣམས་ཡོངས་སུ་མི་གཏོང་བ་ལགས། བཀའ་སྩལ་པ།
en: “Blessed One, how does one not forsake beings?”

source: རྒྱལ་པོ་ཆེན་པོ་གང་གི་ཚེ་བདག་གི་བདེ་བ་ཡོངས་སུ་གཏོང་བའོ། །
en: “Great King, it happens when one forsakes one’s own welfare.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གི་བདེ་བ་ཡོངས་སུ་གཏོང་བ་ཇི་ལྟ་བུ་ལགས།
en: “Blessed One, how does one forsake one’s own welfare?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སུ་དཀོན་མཆོག་གསུམ་ཡོངས་སུ་མི་གཏོང་བ་ཡིན་ནོ། །
en: “Great King, one does not forsake the Three Jewels.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དཀོན་མཆོག་གསུམ་ཡོངས་སུ་མི་གཏོང་བ་སུ་ལགས།
en: “Blessed One, who does not forsake the Three Jewels?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སུ་ཉོན་མོངས་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་དེ་དཀོན་མཆོག་གསུམ་ཡོངས་སུ་མི་གཏོང་བ་ཡིན་ནོ། །
en: “Great King, one who forsakes the afflictions does not forsake the Three Jewels.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཇི་ཙམ་དུ་དེ་བཞིན་གཤེགས་པས་ཆོས་འདུལ་བ་བསྟན་པ་ལེགས་པར་གསུངས་པ་དང་།
en: At this point, King Ajātaśatru said to the Blessed One, “It is marvelous, Blessed One!

source: ཇི་ཙམ་དུ་དེ་བཞིན་གཤེགས་པས་བསླབ་པ་ལེགས་པར་བཅས་པ་དང་། ཇི་ཙམ་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་བསྟན་པ་རྗེས་སུ་འཐུན་པ་དང་། རྒྱུ་དང་འབྲས་བུ་ཆབ་མི་འཚལ་བ་དང་། རྟག་པ་དང་། ཆད་པ་མ་མཆིས་པ་དང་། ལས་དང་བྱ་བ་ལ་འཇུག་པ་བསྟན་པ་དང་།
en: It is marvelous, Sublime One, how well the Dharma and Discipline made known by the Realized One have been spoken, how well the training of the Realized One has been prescribed, how the teaching of the Dharma by the blessed buddhas conforms with reality, how cause and effect are said to be imperishable, how it avoids the extreme views of eternalism and complete annihilation, how it lays out an introduction to deeds and actions, how the effects of both good and bad actions are said to be imperishable, and how it characterizes keeping one’s word—how well all this has been spoken!

source: དགེ་བ་དང་མི་དགེ་བ་ཆབ་མི་འཚལ་བ་དང་། མི་སླུ་བའི་མཚན་ཉིད་ལེགས་པར་གསུངས་པ་ནི་བཅོམ་ལྡན་འདས་ངོ་མཚར་ལགས་སོ། །བདེ་བར་གཤེགས་པ་ངོ་མཚར་ལགས་སོ། །བཅོམ་ལྡན་འདས་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ་དང་། སྡིག་པའི་གྲོགས་པོས་ཡོངས་སུ་ཟིན་པ་དག་མ་གཏོགས་པ་འདི་ལྟར་རྒྱ་ཆེ་ཞིང་འདི་ལྟར་གྱ་ནོམ་པའི་བསྟན་པ་འདི་ལ་བརྩོན་པ་རྣམས་ལ་སུ་ཞིག་ཟློག་པར་བགྱིད།
en: “Among those here who are intent upon such a lofty and superior teaching, Blessed One, who would dare to harm it, or resist it, or oppose it, apart from those who have not put down roots of virtue or who are surrounded by companions in what is bad?

source: གནོད་པར་བགྱིད། སྤོང་བར་བགྱིད། བཅོམ་ལྡན་འདས་བདག་གིས་ནི་སྔོན་གྱི་དགེ་བའི་རྩ་བ་རྣམས་ལ་བྱས་པ་མི་གཟོ་བར་མི་བགྱིའོ། །
en: “We, Blessed One, ought not to feel ungrateful for the roots of our virtue in the past.

source: གང་གི་མཐུས་བདག་ཉོན་མོངས་པའི་དྲི་མ་ཐམས་ཅད་དང་། སྡིག་པ་ཐམས་ཅད་ལས་རྣམ་པར་ལོག་པའི་དེ་བཞིན་གཤེགས་པ་ལ་བདག་གི་ཤ་དང་། ཁྲག་གིས་ཀྱང་བཀའ་དྲིན་གླན་པའི་རྔོ་མི་ཐོག་ལགས་སོ། །
en: It is certainly not possible for us to repay, even with our own flesh and blood, the Realized One by whose majestic power we have been turned away from all the afflictions.

source: བཅོམ་ལྡན་འདས་གང་གི་མཐུས་བདག་གིས་བཟང་པོ་མ་ལགས་པའི་འགྱོད་པ་ཆེན་པོ་བསལ་བ་དང་། ཆོས་སྣང་བ་ཆེན་པོ་ཐོབ་པར་བགྱིད་པའི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཡུན་རིང་པོའི་དགེ་བའི་བཤེས་གཉེན་ལ་ཡང་བདག་གིས་ལན་གླན་པའི་རྔོ་མི་ཐོག་ལགས་སོ། །
en: Blessed One, it is not even possible for us to repay Prince Mañjuśrī, who has been our companion in the good for a long time and by whose majestic power our regret over the tremendous evil deed we did has been eased and by whose majestic power we have obtained the great light of the Dharma.

source: ཚངས་པའི་སྤྱོད་པ་འདི་མཐའ་དག་ནི་འདི་ལྟ་སྟེ། དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་ངོ་། །ཞེས་བགྱི་བ་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་ལེགས་པར་གསུངས་པའོ། །
en: As the Blessed One has said so well, this holy life in its entirety is due to one’s companions in the good.”

source: མ་སྐྱེས་དགྲས་ཞུས་པ་ལུང་བསྟན་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་ཉི་ཤུ་རྩ་གཉིས་པའོ།། །།
en: This was the twenty-second chapter, “The Explanation of Ajātaśatru’s Questions.”

source: བམ་པོ་བཅུ་པ་སྟེ་ཐ་མ།
en: Chapter 23: On Bhadrarāja

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གསང་བ་པའི་བདག་པོ་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་སྤྲུལ་པ་སྤྲུལ་པ་དེའི་ཚེ། ཁྱོད་ཀྱང་སྤྲུལ་པ་སྤྲུལ་ལམ།
en: At that point, the bodhisattva of great courage, Śāntamati, said this to Vajrapāṇi, Lord of the Guhyakas: “When the Blessed One creates magically created forms of himself, Lord of the Guhyakas, do you create magically created forms of yourself, too?”

source: ལག་ན་རྡོ་རྗེས་སྨྲས་པ། བཅོམ་ལྡན་འདས་མངོན་སུམ་དུ་བཞུགས་པ་འདི་ཁོ་བོའི་དབང་ཡིན་ཏེ། ཞི་བའི་བློ་གྲོས་གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཅིག་སྤྲུལ་ན་ཁོ་བོའི་སྤྲུལ་པ་གཟུགས་ཐ་དད་པ།
en: Vajrapāṇi responded, “I am an eyewitness to what comes directly before the eyes of the Blessed One, Śāntamati, and therefore, even if the Realized One were to create magically created forms of the Realized One equal in number to the grains of sand in the Ganges River, then precisely that many magically created forms of me would accompany them, taking a variety of forms and making child’s play in a variety of ways.

source: རྣམ་པར་རྩེན་པ་ཐ་དད་པ་ཡང་དེ་སྙེད་དེ་དག་གི་རྗེས་སུ་འབྲང་བ་ཡིན་ཏེ། ཞི་བའི་བློ་གྲོས་འདི་ནི་སྔོན་གྱི་བསམ་པ་ཡོངས་སུ་དག་པའི་རྒྱུ་འཐུན་པའོ། །
en: This, Śāntamati, is a natural consequence of the purification of my motivation in the past.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གསང་བ་པའི་བདག་པོ་གང་གི་ཕྱིར་ཕྱི་མའི་ཚེ་ལྔ་བརྒྱ་ཐ་མ་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་པ་དང་། རྒྱས་པར་འགྱུར་བ་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་སྐྱེས་བུ་དམ་པ་དེ་དག་གི་ལག་ཏུ་འགྲོ་བར་དེ་བཞིན་གཤེགས་པ་ལ་གསོལ་བ་ཐོབ་ཤིག །
en: The bodhisattva Śāntamati then said to Vajrapāṇi, Lord of the Guhyakas, “Please make a request of the Blessed One, Lord of the Guhyakas, for this formulation of the Dharma to be circulated and widely distributed in the latter time—that is, in the final five-hundred-year period of the Dharma—and to come into the hands of those good persons who grasp on to the true Dharma.”

source: གསང་བ་པའི་བདག་པོས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་ཟིན་ཏོ། །
en: “This formulation of the Dharma has been empowered by all the buddhas, noble son,” the Lord of the Guhyakas replied.

source: ཡི་གེ་གང་དག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྙད་པའི་ཡི་གེ་དེ་དག་ནི་མ་སྐྱེས་པ།
en: The syllables through which this formulation of the Dharma has been communicated are not real;

source: ཟད་པར་མི་འགྱུར་བ། ནུབ་པར་མི་འགྱུར་བའོ། །
en: they are not exhausted, and they do not disappear.

source: ཡི་གེ་གང་དག་གིས་དོན་གང་བརྗོད་པའི་དོན་དེ་ཡང་ནུབ་པར་བྱ་བར་མི་ནུས་པའོ། །
en: Moreover, the meaning that is expressed through these syllables, too, cannot be made to disappear.

source: ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་ནི་ནུབ་པར་འགྱུར་བ་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ལ་སྐྱེ་བ་ཅི་ཡང་མེད་དོ། །གང་སྐྱེ་བ་མེད་པ་དེ་མི་འགག་གོ། །
en: The true Dharma of the Realized One is not something that can be made to disappear, Śāntamati, because, indeed, it has not arisen in the first place, and what does not arise, does not cease.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་ལ་དགོངས་ནས་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་མ་བྱུང་ཡང་རུང་སྟེ། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་གནས་པ་ཉིད་དང་། ཆོས་ཇི་ལྟ་བ་བཞིན་འདི་ནི་འདུག་པ་ཉིད་དོ། །
en: “With this in mind, the Blessed One has said that whether the realized ones arise or they do not arise, this is what truly remains: the true nature of things wherein things are just as they are in the realm of reality.

source: ཞེས་གསུངས་ཏེ། དེ་ལྟར་ན་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་མི་འགལ་བ་ཡིན་ནོ། །གང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་མི་འགལ་བ་དེ་དམ་པའི་ཆོས་ཡིན་ནོ། །
en: In this way, dependent arising is not impeded, and what does not impede dependent arising is the true Dharma.

source: དམ་པའི་ཆོས་གང་ཡིན་པ་དེ་རྟག་པར་མི་ནུབ་སྟེ། དེས་ན་དམ་པའི་ཆོས་ཞེས་བྱའོ། །
en: And the true Dharma is forever and not something that disappears—for this reason it is called the true Dharma.”

source: ཞི་བའི་བློ་གྲོས་ཀྱིས་སྨྲས་པ། གསང་བ་པའི་བདག་པོ་གང་དག་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་གོ་ཆ་གྱོན་པ་དེ་དག་གང་དུ་གོ་ཆ་གྱོན།
en: “Lord of the Guhyakas, those who prepare themselves to grasp the true Dharma, for what do they prepare themselves?” asked Śāntamati.

source: སྨྲས་པ། གང་དག་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་གོ་ཆ་གྱོན་པ་དེ་དག་ནི་ཆོས་ཐམས་ཅད་དང་མི་འགལ་བར་བྱ་བའི་ཕྱིར་གོ་ཆ་གྱོན་ནོ། །
en: “Those who prepare themselves to grasp the true Dharma prepare themselves not to oppose anything.

source: གང་ཆོས་ཐམས་ཅད་དང་མི་འགལ་བ་དེ་ཉིད་དམ་པའི་ཆོས་སོ། །
en: It is because the true Dharma is precisely what does not oppose anything.”

source: སྨྲས་པ། ཇི་ལྟར་ན་ཆོས་དང་འགལ་བ་ཡིན།
en: “How could there be an opposition to the Dharma?”

source: སྨྲས་པ། ཡི་གེ་དང་འགལ་ན་ཆོས་དང་འགལ་བ་ཡིན་ཏེ། ཆོས་དང་ནི་ནམ་ཡང་འགལ་བར་མི་འགྱུར་རོ། །
en: “From an opposition to syllables, there is an opposition to the Dharma, and the Dharma should not be opposed.

source: དེ་ལ་གང་དག་མི་འགལ་བ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །སྨྲས་པ།
en: Those who are not oppositional in this respect, they grasp the true Dharma completely.”

source: གསང་བ་པའི་བདག་པོ་གང་དག་འཇིག་རྟེན་ཐམས་ཅད་དང་འགལ་བ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའི་རྣམ་གྲངས་ཡོད་དམ།
en: “Is it possible, Lord of the Guhyakas, that a formulation could be opposed by the entire world, and yet it grasps the true Dharma?”

source: སྨྲས་པ། ཞི་བའི་བློ་གྲོས་ཡོད་དེ།
en: “Yes, it is possible, Śāntamati.

source: ཞི་བའི་བློ་གྲོས་འཇིག་རྟེན་ནི་ལྟ་བ་ལ་མངོན་པར་ཞེན་པ་ཡིན་ལ། དེ་ནི་སྟོང་པ་ཉིད་དུ་སྨྲ་བ་ཡིན་ཏེ། དེས་ན་དེ་འཇིག་རྟེན་ཐམས་ཅད་དང་འགལ་ལོ། །
en: The world is strongly attached to views, Śāntamati, and so one who affirms emptiness is, for this reason, opposed by the whole world.

source: འཇིག་རྟེན་ནི་རྟག་པ་དང་། བདེ་བ་དང་། བདག་དང་། བདག་གིར་སྨྲ་བ་ཡིན་ལ་དེ་ནི་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་།
en: The world affirms permanence, happiness, beauty, ‘I,’ and ‘mine,’ and so one who affirms impermanence, suffering, repulsiveness, ‘not-self,’ and ‘not-mine’ is, for this reason, opposed by the whole world.

source: མི་སྡུག་པ་དང་། བདག་དང་བདག་གིར་མེད་པར་སྨྲ་བ་ཡིན་ཏེ། དེས་ན་དེ་འཇིག་རྟེན་ཐམས་ཅད་དང་འགལ་ལོ། །འཇིག་རྟེན་ནི་རྒྱུན་ཕྱོགས་སུ་འགྲོ་བ་ཡིན་ལ་དེ་ནི་རྒྱུན་ལས་བཟློག་སྟེ། འགྲོ་བས་དེས་ན་དེ་འཇིག་རྟེན་ཐམས་ཅད་དང་འགལ་ལོ། །
en: The world goes with the current, and so one who goes against the current is, for this reason, opposed by the whole world.

source: འཇིག་རྟེན་ནི་ཚེ་འདི་ལྷུར་ལེན་པ་ཡིན་ལ། དེ་ནི་ཚེ་རབས་འཕོ་བ་ལྷུར་ལེན་པ་ཡིན་ཏེ། དེས་ན་དེ་འཇིག་རྟེན་ཐམས་ཅད་དང་འགལ་ལོ། །
en: The world puts the weight on this lifetime, and so one who puts the weight on a future lifetime is, for this reason, opposed by the whole world.

source: འཇིག་རྟེན་ནི་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་ལ་མངོན་པར་ཞེན་པ་ཡིན་ལ་དེ་ནི་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །དེས་ན་དེ་འཇིག་རྟེན་ཐམས་ཅད་དང་འགལ་ལོ། །
en: The world is strongly attached to the aggregates, the elements, and the sense spheres, and so one who teaches the Dharma to be completely unattached to all things is, for this reason, opposed by the whole world.

source: ཞི་བའི་བློ་གྲོས་རྣམ་གྲངས་འདིས་ན་གང་དག་འཇིག་རྟེན་ཐམས་ཅད་དང་འགལ་བ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་ཏོ། །སྨྲས་པ།
en: In this manner, Śāntamati, the one who is opposed by the whole world grasps the true Dharma.”

source: གསང་བ་པའི་བདག་པོ་ཁྱོད་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་ཏམ།
en: “Do you grasp the true Dharma, Lord of the Guhyakas?”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་ཡོངས་སུ་འཛིན་ཏེ། བདག་ཡོངས་སུ་མི་འཛིན། སེམས་ཅན་ཡོངས་སུ་མི་འཛིན། ཆོས་ཡོངས་སུ་མི་འཛིན་ཏོ། །
en: “I grasp it, noble son, but I do not grasp an ‘I,’ or a being, or a thing.”

source: སྨྲས་པ། ཇི་ལྟར་ཡོངས་སུ་འཛིན། སྨྲས་པ།
en: “How then do you grasp it?”

source: བདག་དབེན་པ་དང་། སེམས་ཅན་དབེན་པ་དང་། ཆོས་དབེན་པ་དང་། བདག་དང་། སེམས་ཅན་དང་། ཆོས་དབེན་པ་མ་ཡིན་པ་དང་། འདས་པ་དབེན་པ་དང་།
en: “I grasp it as something separate from and free of an ‘I,’ as something separate from and free of a being, and as something separate from and free of a thing, and as something not separate from and not free of an ‘I,’ a being, or a thing.

source: མ་འོངས་པ་དབེན་པ་དང་། ད་ལྟར་བྱུང་བ་དབེན་པ་དང་། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དུས་དབེན་པ་དང་། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དུས་དབེན་པ་མ་ཡིན་པ་དང་།
en: I grasp it as something separate from and free of a past, a present, and a future, and as something not separate from and not free of a past, a present, and a future.

source: སངས་རྒྱས་དབེན་པ་དང་། སངས་རྒྱས་དབེན་པ་མ་ཡིན་པ་དང་།
en: I grasp it as something separate from and free of an awakened one, and as something not separate from and not free of an awakened one.

source: ཞིང་དབེན་པ་དང་། ཞིང་དབེན་པ་མ་ཡིན་པ་དང་། ཆོས་དབེན་པ་དང་།
en: I grasp it as something separate from and free of a domain, and as something not separate from and not free of a domain.

source: ཆོས་དབེན་པ་མ་ཡིན་པར་གང་དེ་ལྟར་ཆོས་རྣམས་རྗེས་སུ་རྟོགས་པ་དེ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: I grasp it as something separate from and free of the Dharma, and as something not separate from and not free of the Dharma.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ། སྐྱེས་བུ་དམ་པ་ལེགས་སོ་ལེགས་སོ། །
en: At that point, the Blessed One congratulated Vajrapāṇi, Lord of the Guhyakas: “Excellent, my good man, excellent!

source: འདི་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: This is what it means to grasp the true Dharma.

source: གསང་བ་པའི་བདག་པོ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ནི་གང་ཆོས་ཐམས་ཅད་མི་འཛིན་པ་དང་། མཆོག་ཏུ་འཛིན་པ་མེད་པ་དང་། གང་ཆོས་ཐམས་ཅད་ལ་མཚན་མ་དང་སྤྲོས་པར་མི་འཛིན་པ་དང་། ཀུན་ཏུ་སྤྱོད་པ་མེད་པ་དང་། གང་ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་ལ་མི་རྟོག་ཅིང་རྣམ་པར་མི་རྟོག་པའོ། །
en: Moreover, Lord of the Guhyakas, those who grasp the true Dharma do not grasp anything or cling to anything, they do not grasp on to or act upon any vain imaginings of a mental image of a being, and they do not form an idea or form a concept of any figment of the imagination.”

source: དེའི་ཚེ་ལྷའི་བུ་རྒྱལ་པོ་བཟང་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་པ་དེས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཉེ་བར་ཞི་བ་ནི་སངས་རྒྱས་ཀྱི་བཀའ་ལགས་སོ། །
en: There was also a god named Bhadrarāja sitting in the assembly at that time, and he said to the Blessed One, “Blessed One, calming is the word of the Buddha, and, Blessed One, what makes it the word of the Buddha is that it is the word of one who is calmed.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་བཀའ་ནི་ཉེ་བར་ཞི་བར་བགྱི་བའི་ཆེད་ལགས་ཏེ། ཉེ་བར་ཞི་བ་གང་ལགས་པ་དེས་སངས་རྒྱས་ཀྱི་བཀའོ། །
en: So, one who is calmed possesses the word of the Buddha.

source: བཅོམ་ལྡན་འདས་དེ་ལ་གང་དག་དམིགས་པ་ཐམས་ཅད་ཉེ་བར་ཞི་བར་མཐོང་བ་དེ་དག་ཉེ་བར་ཞི་བ་ལགས་ཏེ།
en: In this regard, Blessed One, those who see all objects of cognition as being calmed are those who are calmed themselves.

source: དེ་དག་ནི་སླད་ཀྱིས་འབར་བ་མ་ལགས། མཆེད་པ་མ་ལགས་འབར་བར་བགྱིད་པ་མ་ལགས་སོ། །གང་དག་ཞི་བ་དང་། རབ་ཏུ་ཞི་བ་དང་།
en: Being calmed themselves, they are not set on fire, they do not burn, and they are not consumed by fire.

source: ཉེ་བར་ཞི་བ་དེ་དག་དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་ཅིང་མི་འདོར་བ་ལགས་ཏེ། ཇི་ལྟར་ཆོས་ཐམས་ཅད་མི་འཛིན་མི་འདོར་བ་དེ་ལྟར་འཛིན་ཏོ། །
en: Those who are calmed, quiet, and at peace retain the true Dharma of the Realized One in their minds, and they retain it in their minds in such a way that they do not hold on to or let go of anything.”

source: ལྷའི་བུ་དེས་དེ་སྐད་བསྟན་པས་དགེ་སློང་སྟོང་ནི་སེམས་རྣམ་པར་གྲོལ་ལོ། །ལྷའི་བུ་སྟོང་ནི་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་གོ། །
en: When the god had expressed this point, a thousand monks became liberated in their minds, and the Dharma eyes of a thousand gods were purified.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས་ལྷའི་བུ་རྒྱལ་པོ་བཟང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷའི་བུ་སྤོབས་པ་འདི་སུའི་ཡིན། སྨྲས་པ།
en: The bodhisattva Śāntamati then asked the god Bhadrarāja, “Divine one, who possesses this inspired eloquence?”

source: སྤོབས་པ་འདི་ནི་སུ་བག་ཆགས་ཐམས་ཅད་སྤངས་པ་དང་། ཚིག་གི་ལམ་ཐམས་ཅད་མེད་པ་དང་། དོན་དམ་པ་བརྗོད་དུ་མེད་པ་དང་། མངོན་པར་ཞེན་པ་མེད་པ་དེ་དག་གི་སྤོབས་པ་ཡིན་ནོ། །སྨྲས་པ།
en: “This is the inspired eloquence of those who have eliminated any lingering traces of past actions, those who have gone beyond the range of language, those who are indescribable from the standpoint of ultimate truth, and those to whom nothing is stuck.”

source: ལྷའི་བུ་སྤོབས་པ་ཇི་ལྟར་སྐྱེ། སྨྲས་པ།
en: “Divine one, how is this inspired eloquence born?”

source: སྤོབས་པ་མེད་པ་དང་། སྤོབས་པ་མ་ཡིན་པའི་ཕྱིར་རོ། །
en: “It is born by reason of the fact that there is no inspired eloquence and there is an absence of inspired eloquence.

source: སྤོབས་པ་མེད་པ་ཞེས་བྱ་བ་དེ་ནི་ཉིང་མཚམས་སྦྱོར་བ་མེད་པའི་ཚིག་གོ། །སྤོབས་པ་མ་ཡིན་པ་ཞེས་བྱ་བ་དེ་ནི་སྤྲོས་པ་མེད་པའི་ཚིག་གོ། །
en: ‘No inspired eloquence’ is a way of saying that there is no link to rebirth, while ‘an absence of inspired eloquence’ is a way of saying that there is an absence of the proliferation of vain imagining.

source: རིགས་ཀྱི་བུ་འདི་སྐད་དུ་སྤོབས་པ་འདི་སུའི་ཡིན་ཞེས་སྨྲས་པ་ལ། འདི་ནི་སུ་གཞན་གྱི་རྣམ་པར་རིག་པ་ལ་རྣམ་པར་ཤེས་པ་མི་འཇུག་པ་དང་། བདག་གི་རྣམ་པར་རིག་པ་ལ་རྣམ་པར་ཤེས་པ་མི་གནས་པ་དེའི་སྤོབས་པའོ། །
en: “Furthermore, noble son, since you ask who possesses this inspired eloquence, it is the inspired eloquence of one for whom consciousness does not arise in regard to the imputation of a body, and one for whom consciousness is not established in regard to the imputation of a self;

source: འདི་ནི་སུ་དམིགས་པ་ལ་ཡང་ཡིད་ཀྱི་རྣམ་པར་རིག་པ་མི་དམིགས་ལ་དམིགས་པ་མེད་པའི་ཆོས་ཉིད་ལ་ཡང་མི་གནས་པ་དེའི་སྤོབས་པའོ། །
en: it is the inspired eloquence of one for whom the imputation of a mind is not taken up as an object of cognition, and who dwells in a state in which things are unobscured;

source: འདི་ནི་སུ་ཆོས་ཐམས་ཅད་ལ་ཡང་ཤེས་པ་མི་འཇུག་ལ་དེ་ཤེས་པས་ཆོས་གང་ཡང་རབ་ཏུ་མ་རྟོགས་པ་མེད་པ་དེའི་སྤོབས་པའོ། །
en: it is the inspired eloquence of one for whom knowledge does not arise with regard to anything, and one for whom nothing is especially known by means of knowledge;

source: འདི་ནི་སུ་གནས་པ་མེད་པ་དང་། ལེན་པ་མེད་པ་དང་། འདོར་བ་མེད་པ་དང་། ཆུ་བོ་ལས་རྒལ་བ་དེའི་སྤོབས་པའོ། །
en: and it is the inspired eloquence of one who stands still, does not exert any effort, but crosses the flood.

source: འདི་ནི་སྐྱེ་བ་མེད་ལ་སྐྱེས་པ་དང་འགོག་པ་ཡང་མེད་ལ་མྱ་ངན་ལས་འདའ་བར་ཡང་འགྱུར་བ་དེའི་སྤོབས་པའོ། །
en: It is the inspired eloquence of someone who is born, while being one who is not born, and who enters nirvāṇa, while being one for whom there is no cessation.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ལྷའི་བུ་རྒྱལ་པོ་བཟང་འདིའི་སྤོབས་པ་ནི་ངོ་མཚར་ལགས་སོ། །
en: Then the bodhisattva Śāntamati said to the Blessed One, “Blessed One, the inspired eloquence of the god Bhadrarāja is marvelous!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཞི་བའི་བློ་གྲོས་ལྷའི་བུ་རྒྱལ་པོ་བཟང་འདི་ནི་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་དེ་བཞིན་གཤེགས་པའི་གསང་བ་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉན་པར་འདོད་ནས་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བ་ནས་འདིར་འོངས་སོ། །ཞི་བའི་བློ་གྲོས་ལྷའི་བུ་རྒྱལ་པོ་བཟང་འདིས་ཆོས་ཀྱི་རྣམ་པའི་རྗེས་སུ་འཇུག་པ་ཞེས་བྱ་བའི་གཟུངས་ཐོབ་སྟེ།
en: The Blessed One said, “Śāntamati, the god Bhadrarāja has come here from Abhiratī, the buddha domain of the realized one Akṣobhya, in order to hear the teaching from Vajrapāṇi, Lord of the Guhyakas, of this formulation of the Dharma, ‘The Secret of the Realized One.’ Śāntamati, the god Bhadrarāja has acquired a powerful mnemonic formula called accessing the aspects of the Dharma.

source: དེ་འདོད་ན་བསྐལ་པ་བརྒྱ་སྟོང་དུ་ཐོགས་པ་མེད་པའི་སྤོབས་པས་བསྟན་ཀྱང་འདིའི་སྤོབས་པ་ཟད་པར་མི་འགྱུར་རོ། །
en: If he wished, he could teach for hundreds of thousands of eons with his inspired eloquence unimpeded, and still his inspired eloquence would not be exhausted.”

source: རྒྱལ་པོ་བཟང་གི་ལེའུ་ཞེས་བྱ་བ་སྟེ་ཉི་ཤུ་རྩ་གསུམ་པའོ།། །།
en: This was the twenty-third chapter, “On Bhadrarāja.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Chapter 24: The Inexhaustible Nature of the Analogies in Praise of the Virtues of Powerful Memory and the Formulas That Support It

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་པའི་རྗེས་སུ་འཇུག་པ་ཞེས་བགྱི་བའི་གཟུངས་དེ་གང་ལགས།
en: The bodhisattva Śāntamati then asked the Blessed One, “Blessed One, what kind of powerful mnemonic formula is the one called accessing the aspects of the Dharma?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཞི་བའི་བློ་གྲོས་ཆོས་ཀྱི་རྣམ་པའི་རྗེས་སུ་འཇུག་པ་ནི་གང་ཡི་གེ་རྣམས་ལ་ཡི་གེའི་རྗེས་སུ་འཇུག་པ་ཤེས་པ་སྟེ།
en: “Śāntamati,” the Blessed One answered, “accessing the aspects of the Dharma is the knowledge that accesses the imperishable in syllables.

source: ཞི་བའི་བློ་གྲོས་ཆོས་ཐམས་ཅད་ནི་ཨ་ཞེས་བྱ་བའི་རྗེས་སུ་འཇུག་པའོ། །
en: Śāntamati, all things have the syllable ā as their point of entry.

source: ཆོས་ཐམས་ཅད་ནི་ཨ་ཞེས་བྱ་བའི་སྒོའོ། །
en: All things have the syllable ā as their gateway;

source: ཨ་ཞེས་བྱ་བ་ལས་བྱུང་བའོ། །
en: they are created from the syllable ā;

source: ཨ་ཞེས་བྱ་བའི་མཐའོ། །
en: they reach their end in the syllable ā.

source: ཨ་ཞེས་བྱ་བ་ནི་ཚིག་གི་ལས་ཐམས་ཅད་ལ་ལས་བྱེད་དོ། །ཨ་ཞེས་བྱ་བ་ནི་མི་ཤེས་པའོ། །
en: The syllable ā does the action in verbal action, but the syllable ā does not know;

source: རྣམ་པར་མ་ཤེས་པའོ། །ཆོས་ཐམས་ཅད་ནི་ཨ་ཞེས་བྱ་བའི་རྗེས་སུ་འཇུག་སྟེ།
en: it does not ascertain, and yet it is the point of entry to all things.

source: དེའི་ཕྱིར་རྣམ་པའི་རྗེས་སུ་འཇུག་པ་ཞེས་བྱ་བའི་གཟུངས་ཞེས་བྱའོ། །
en: This is why the powerful mnemonic formula is called accessing the aspects of the Dharma.

source: ཞི་བའི་བློ་གྲོས་རྗེས་སུ་འཇུག་པ་ནི་དེ་ལ་ཆོས་ཕྲ་རབ་ཙམ་ཡང་ཞུགས་པ་མེད་པ་དང་། བྱུང་བ་མེད་པའོ། །
en: “Access means in this case that nothing, Śāntamati, not even an atom, has entered or exited.

source: ཞི་བའི་བློ་གྲོས་ཡི་གེ་དེ་དག་ནི་ག་ཞིག་ནས་ལྷགས་ནས་ཁོང་པའི་ནང་དུ་འཇུག་པ་མེད་དོ། །
en: The syllables, Śāntamati, do not come from somewhere and enter an interior space inside the body;

source: ཡི་གེ་དེ་དག་ནི་ཁོང་པའི་ནང་དུ་གནས་པ་མ་ཡིན་ནོ། །
en: also, the syllables neither take up residence within an interior space inside the body, nor do the syllables come out and then go in some direction.

source: ཡི་གེ་དེ་དག་ནི་བྱུང་ནས་ཕྱོགས་ག་ཞིག་ཏུ་འགྲོ་བ་མ་ཡིན་ནོ། །
en: The syllables also do not stimulate one another.

source: ཡི་གེ་དེ་དག་ནི་ཕན་ཚུན་འབར་བར་བྱེད་པ་མ་ཡིན་ནོ། །
en: The syllables also do not form an idea of right or wrong.

source: ཡི་གེ་དེ་དག་ནི་སྨྲས་ཀྱང་རུང་མ་སྨྲས་ཀྱང་རུང་སྟེ།
en: The syllables are not pronounced, nor are they not pronounced.

source: ཟད་པར་འགྱུར་བའམ། འཕེལ་བར་འགྱུར་བ་མ་ཡིན་ནོ། །
en: They do not waste away, and they do not grow.
